IDEA Open Model
MatReinforcementEc2.DiagramType Property
Compatible with IDEA StatiCa Beta 20.0
 Type of material diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public ReinfDiagramType DiagramType { get; set; }
Public Property DiagramType As ReinfDiagramType
	Get
	Set
Property Value
Type: ReinfDiagramType
See Also
Reference
MatReinforcementEc2 Class
IdeaRS.OpenModel.Material Namespace